[
  {
    "concept": "shape",
    "sub_concepts": [
      {
        "name": "symmetry",
        "samples": [
          {
            "gt": ["boulder", "book", "sunflower"],
            "prefix": "Consider a book, a boulder, and a sunflower. Rank these objects from the least to the most symmetry axis.",
            "t2i_prompt": "A realistic image with a sunflower, a boulder, and a book. With the magnitude of SYMMETRY significantly higher for the sunflower, and the magnitude of SYMMETRY significantly lower for the boulder."
          },
          {
            "gt": ["rock", "door", "starfish"],
            "prefix": "Consider a starfish, a rock, and a door. Rank these objects from the least to the most symmetry axis.",
            "t2i_prompt": "A realistic image with a starfish, a rock, and a door. With the magnitude of SYMMETRY significantly higher for the starfish, and the magnitude of SYMMETRY significantly lower for the rock."
          },
          {
            "gt": ["pebble", "fern", "snowflake"],
            "prefix": "Consider a fern, a snowflake, and a pebble. Rank these objects from the least to the most symmetry axis.",
            "t2i_prompt": "A realistic image with a snowflake, a pebble, and a fern. With the magnitude of SYMMETRY significantly higher for the snowflake, and the magnitude of SYMMETRY significantly lower for the pebble."
          }
        ]
      },
      {
        "name": "curvature",
        "samples": [
          {
            "gt": ["cloud", "spoon", "basketball"],
            "prefix": "Consider a spoon, a basketball, and a cloud. Rank these objects from the least uniform to the most uniform curvature.",
            "t2i_prompt": "A realistic image with a basketball, a cloud, and a spoon. With the magnitude of CURVATURE significantly more uniform for the basketball, and the magnitude of CURVATURE significantly less uniform for the cloud."
          },
          {
            "gt": ["toast", "tree branch", "orange"],
            "prefix": "Consider an orange, a toast, and a tree branch. Rank these objects from the least uniform to the most uniform curvature.",
            "t2i_prompt": "A realistic image with an orange, a tree branch, and a toast. With the magnitude of CURVATURE significantly more uniform for the orange, and the magnitude of CURVATURE significantly less uniform for the toast."
          },
          {
            "gt": ["coral", "scythe", "pear"],
            "prefix": "Consider a scythe, a pear, and a coral. Rank these objects from the least uniform to the most uniform curvature.",
            "t2i_prompt": "A realistic image with a pear, a scythe, and a coral. With the magnitude of CURVATURE significantly more uniform for the pear, and the magnitude of CURVATURE significantly less uniform for the coral."
          }
        ]
      },
      {
        "name": "edge",
        "samples": [
          {
            "gt": ["wheel", "book", "starfish"],
            "prefix": "Consider the outline of the front of a starfish, a wheel, and a book. Rank these objects from the fewest to the most edges.",
            "t2i_prompt": "A realistic image with a wheel, a book, and a starfish. With the magnitude of EDGE significantly higher for the starfish, and the magnitude of EDGE significantly lower for the wheel."
          },
          {
            "gt": ["egg", "brick", "snowflake"],
            "prefix": "Consider the outline of the front of an egg, a brick, and a snowflake. Rank these objects from the fewest to the most edges.",
            "t2i_prompt": "A realistic image with an egg, a brick, and a snowflake. With the magnitude of EDGE significantly higher for the snowflake, and the magnitude of EDGE significantly lower for the egg."
          },
          {
            "gt": ["pyramid", "picture frame", "sunflower"],
            "prefix": "Consider the outline of the front of a sunflower, a pyramid, and a picture frame. Rank these objects from the fewest to the most edges.",
            "t2i_prompt": "A realistic image with a pyramid, a picture frame, and a sunflower. With the magnitude of EDGE significantly higher for the picture frame, and the magnitude of EDGE significantly lower for the pyramid."
          }
        ]
      }
    ]
  },
  {
    "concept": "color",
    "sub_concepts": [
      {
        "name": "hue",
        "samples": [
          {
            "gt": ["Amber gemstone", "eggplant", "Clay brick"],
            "prefix": "Consider a eggplant, an amber gemstone, and a clay brick. Rank these objects from the most bluish to the most reddish hue.",
            "t2i_prompt": "A realistic image with a eggplant, an amber gemstone, and a clay brick. The eggpant has a bluish hue, the gemstone has a yellowish hue, and the brick has a reddish hue."
          },
          {
            "gt": ["Honeycomb", "Terracotta pottery", "Sapphire"],
            "prefix": "Consider a sapphire, a honeycomb, and terracotta pottery. Rank these objects from the most bluish to the most reddish hue.",
            "t2i_prompt": "A realistic image showing a sapphire, a honeycomb, and terracotta pottery. The sapphire has a bluish hue, the honeycomb has a yellowish hue, and the pottery has a reddish hue."
          },
          {
            "gt": ["Mussel shell", "Rusty metal", "Tawny owl feather"],
            "prefix": "Consider a mussel shell, a tawny owl feather, and rusty metal. Rank these objects from the most bluish to the most reddish hue.",
            "t2i_prompt": "A realistic image with a mussel shell, tawny owl feather, and rusty metal. The shell has a bluish hue, the feather has a yellowish hue, and the metal has a reddish hue."
          }
        ]
      }
    ]
  },
  {
    "concept": "size",
    "sub_concepts": [
      {
        "name": "volume",
        "samples": [
          {
            "gt": ["bear", "tree", "mountain range"],
            "prefix": "Consider a tree, a mountain range, and a bear. Rank these objects from the smallest to the largest volume.",
            "t2i_prompt": "A realistic image with a bear, a tree, and a mountain range. With the magnitude of VOLUME significantly larger for the mountain range, and the magnitude of VOLUME significantly smaller for the bear."
          },
          {
            "gt": ["pebble", "house", "island"],
            "prefix": "Consider a house, a pebble, and an island. Rank these objects from the smallest to the largest volume.",
            "t2i_prompt": "A realistic image with a pebble, a house, and an island. With the magnitude of VOLUME significantly larger for the island, and the magnitude of VOLUME significantly smaller for the pebble."
          },
          {
            "gt": ["grain of rice", "car", "valley"],
            "prefix": "Consider a car, a valley, and a grain of rice. Rank these objects from the smallest to the largest volume.",
            "t2i_prompt": "A realistic image with a grain of rice, a car, and a valley. With the magnitude of VOLUME significantly larger for the valley, and the magnitude of VOLUME significantly smaller for the grain of rice."
          }
        ]
      }
    ]
  },
  {
    "concept": "texture",
    "sub_concepts": [
      {
        "name": "directionality",
        "samples": [
          {
            "gt": ["cheese wedge", "chainmail", "zebra"],
            "prefix": "Consider a cheese wedge, a chainmail, and a zebra. Rank these objects from the least to the most uniform directionality.",
            "t2i_prompt": "A realistic image with a cheese wedge, a chainmail, and a zebra. The cheese wedge has a spotted, irregular texture, the chainmail displays an interwoven pattern, and the zebra has parallel, directional stripes, with the magnitude of DIRECTIONALITY significantly higher for the zebra."
          },
          {
            "gt": ["sponge", "basket", "barcode"],
            "prefix": "Consider a sponge, a basket, and a barcode. Rank these objects from the least to the most uniform directionality.",
            "t2i_prompt": "A realistic image with a sponge, a basket, and a barcode. The sponge has a rough, spotted texture, the basket has interwoven, slightly directional fibers, and the barcode has clearly defined parallel stripes, with the magnitude of DIRECTIONALITY significantly higher for the barcode."
          },
          {
            "gt": ["cheetah", "fish net", "american flag"],
            "prefix": "Consider a cheetah, a fish net, and an American flag. Rank these objects from the least to the most uniform directionality.",
            "t2i_prompt": "A realistic image with a cheetah, a fish net, and an American flag. The cheetah has irregular, spotted fur, the fish net has an interwoven structure, and the American flag displays clearly defined alternating stripes, with the magnitude of DIRECTIONALITY significantly higher for the American flag."
          }
        ]
      },
      {
        "name": "fineness",
        "samples": [
          {
            "gt": ["rope", "basketball", "silk curtain"],
            "prefix": "Consider a silk curtain, a basketball, and rope. Rank these objects from the lowest to the highest fineness.",
            "t2i_prompt": "A realistic image with a silk curtain, a basketball, and rope. The silk curtain has the highest fineness, smooth with no bumps, the basketball has medium fineness, with visible texture but still almost pure, and the rope has the lowest fineness, full of visible bumps and unevenness."
          },
          {
            "gt": ["tree bark", "waffle", "pillow"],
            "prefix": "Consider a pillow, tree bark, and a waffle. Rank these objects from the lowest to the highest fineness.",
            "t2i_prompt": "A realistic image with a pillow, a waffle, and tree bark. The pillow has the highest fineness, smooth and soft, the waffle has medium fineness, with visible texture but almost pure, and the tree bark has the lowest fineness, full of rough, uneven bumps."
          },
          {
            "gt": ["pebble road", "tennis ball", "dress"],
            "prefix": "Consider a dress, a pebble road, and a tennis ball. Rank these objects from the lowest to the highest fineness.",
            "t2i_prompt": "A realistic image with a dress, a tennis ball, and a pebble road. The dress has the highest fineness, smooth and pure, the tennis ball has medium fineness, with visible texture but almost pure, and the pebble road has the lowest fineness, full of rough, uneven pebbles."
          }
        ]
      },
      {
        "name": "regularity",
        "samples": [
          {
            "gt": ["bouquet", "cracked earth", "plaid shirt"],
            "prefix": "Consider a bouquet, cracked earth, and a plaid shirt. Rank these objects from the lowest to the highest regularity, where low regularity means more randomness and high regularity means a clearly structured, repeating pattern.",
            "t2i_prompt": "A realistic image of a bouquet of flowers, cracked earth, and a plaid shirt. The bouquet is randomly arranged, cracked earth has irregular patterns, and the plaid shirt has a structured, repeating striped pattern."
          },
          {
            "gt": ["haystack", "gravel path", "brick wall"],
            "prefix": "Consider a haystack, gravel path, and a brick wall. Rank these objects from the lowest to the highest regularity, with low regularity being random and high regularity being uniform and structured.",
            "t2i_prompt": "A realistic image of a haystack, gravel path, and brick wall. The haystack is a disorganized pile, the gravel path has irregular stone arrangements, and the brick wall has uniform, repeating bricks."
          },
          {
            "gt": ["pile of leaves", "wooden deck", "checkerboard"],
            "prefix": "Consider a pile of leaves, a wooden deck, and a checkerboard. Rank these objects from the lowest to the highest regularity, where low regularity is more random and high regularity is highly structured.",
            "t2i_prompt": "A realistic image of a pile of leaves, a wooden deck, and a checkerboard. The pile of leaves is chaotic, the wooden deck has some organized planks, and the checkerboard has an even, repeating pattern."
          }
        ]
      },
      {
        "name": "reflectivity",
        "samples": [
          {
            "gt": ["candle", "granite countertop", "river"],
            "prefix": "Consider a granite countertop, a river, and candle. Rank these objects from the lowest to the highest reflectivity.",
            "t2i_prompt": "A realistic image with a river, a granite countertop, and candle. With the magnitude of REFLECTIVITY significantly higher for the river, and the magnitude of REFLECTIVITY significantly lower for the candle."
          },
          {
            "gt": ["soil", "lake", "mirror"],
            "prefix": "Consider a lake, a mirror, and soil. Rank these objects from the lowest to the highest reflectivity.",
            "t2i_prompt": "A realistic image with a mirror, a lake, and soil. With the magnitude of REFLECTIVITY significantly higher for the mirror, and the magnitude of REFLECTIVITY significantly lower for the soil."
          },
          {
            "gt": ["moss", "pond", "aluminum foil"],
            "prefix": "Consider aluminum foil, moss, and a pond. Rank these objects from the lowest to the highest reflectivity.",
            "t2i_prompt": "A realistic image with aluminum foil, a pond, and moss. With the magnitude of REFLECTIVITY significantly higher for the aluminum foil, and the magnitude of REFLECTIVITY significantly lower for the moss."
          }
        ]
      },
      {
        "name": "transparency",
        "samples": [
          {
            "gt": ["brick", "plastic film", "glass"],
            "prefix": "Consider plastic film, a brick, and glass. Rank these objects from the lowest to the highest transparency.",
            "t2i_prompt": "A realistic image with glass, a brick, and plastic film. With the magnitude of TRANSPARENCY significantly higher for the glass, and the magnitude of TRANSPARENCY significantly lower for the brick."
          },
          {
            "gt": ["concrete wall", "plastic sheet", "car windshield"],
            "prefix": "Consider a clear plastic sheet, a concrete wall, and car windshield. Rank these objects from the lowest to the highest transparency.",
            "t2i_prompt": "A realistic image with a car windshield, a concrete wall, and a clear plastic sheet. With the magnitude of TRANSPARENCY significantly higher for the window pane, and the magnitude of TRANSPARENCY significantly lower for the concrete wall."
          },
          {
            "gt": ["pillow", "silk curtain", "empty glass"],
            "prefix": "Consider an empty glass, a pillow, and a silk curtain. Rank these objects from the lowest to the highest transparency.",
            "t2i_prompt": "A realistic image with an empty glass, a pillow, and a silk curtain. With the magnitude of TRANSPARENCY significantly higher for the acrylic block, and the magnitude of TRANSPARENCY significantly lower for the pillow."
          }
        ]
      }
    ]
  }
]